Show / Hide Table of Contents
Class OpenObject
Open object base class POS - class can not be abstract -it causes problems with serialization
Inheritance
System.Object
OpenObject
CalculationSetup
StagesLoading
ProjectDataConcrete
TimeAxis
TimePoint
CssComponent
Parameter
ReinforcedBar
Stirrup
TendonBar
TendonDuct
LoadBase
Point2D
Polygon2D
PolyLine2D
Region2D
Segment2D
Vector2D
CoordSystem
Polygon3D
Vector3D
CombiItem
CrossSectionComponentEdges
MaterialStrength
MaterialStrengthProperty
OpenMessage
DesignMemberInSubStructure
RebarHookBase
RebarPolyLine3D
RebarSegment3DBase
SubStructureGeometry
SubStructureLoading
OpenAttribute
OpenElementId
OriginSettings
ProjectData
ProjectDataEc
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class OpenObject
 Improve this Doc
 View Source